In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data_gas.csv')

In [3]:
df.rename(columns={' DATA INICIAL': 'DATA INICIAL'}, inplace=True)

# Estabelecendo datas, simplificando-as estabelecendo a ordem do DF por elas
df['DATA INICIAL'] = pd.to_datetime(df['DATA INICIAL'])
df['DATA FINAL'] = pd.to_datetime(df['DATA FINAL'])
df['DATA MEDIA'] = ((df['DATA FINAL'] - df['DATA INICIAL'])/2) + df['DATA INICIAL']

In [4]:
df = df.sort_values(by='DATA MEDIA',ascending=True)
df.rename(columns = {'DATA MEDIA':'DATA'}, inplace = True)
df.rename(columns = {'PREÇO MÉDIO REVENDA': 'VALOR REVENDA (R$/L)'}, inplace=True)

In [5]:
# Criando uma coluna de Ano
df["ANO"] = df["DATA"].apply(lambda x: str(x.year))

# Resetando o index por uma questão organizacional
df = df.reset_index()

# Filtrando pois só falaremos da gasolina comum
df = df[df.PRODUTO == 'GASOLINA COMUM']

In [6]:
# Excluindo colunas que não usaremos
df.drop(['UNIDADE DE MEDIDA', 'COEF DE VARIAÇÃO REVENDA', 'COEF DE VARIAÇÃO DISTRIBUIÇÃO', 
    'NÚMERO DE POSTOS PESQUISADOS', 'DATA INICIAL', 'DATA FINAL', 'PREÇO MÁXIMO DISTRIBUIÇÃO', 'PREÇO MÍNIMO DISTRIBUIÇÃO', 
    'DESVIO PADRÃO DISTRIBUIÇÃO', 'MARGEM MÉDIA REVENDA', 'PREÇO MÍNIMO REVENDA', 'PREÇO MÁXIMO REVENDA', 'DESVIO PADRÃO REVENDA', 
    'PRODUTO', 'PREÇO MÉDIO DISTRIBUIÇÃO'], inplace=True, axis=1)

In [8]:
df = df.reset_index()
df.head()

,level_0,index,REGIÃO,ESTADO,VALOR REVENDA (R$/L),DATA,ANO
0,1,12090,SUL,SANTA CATARINA,2.070,2004-05-12,2004
1,10,12089,SUL,RIO GRANDE DO SUL,2.135,2004-05-12,2004
2,23,12088,SUL,PARANA,1.966,2004-05-12,2004
3,24,12086,SUDESTE,RIO DE JANEIRO,2.045,2004-05-12,2004
4,25,12066,CENTRO OESTE,MATO GROSSO,2.358,2004-05-12,2004

In [9]:
df.drop(['level_0', 'index'], inplace=True, axis=1)
df.head()

         REGIÃO             ESTADO  VALOR REVENDA (R$/L)       DATA   ANO
0           SUL     SANTA CATARINA                 2.070 2004-05-12  2004
1           SUL  RIO GRANDE DO SUL                 2.135 2004-05-12  2004
2           SUL             PARANA                 1.966 2004-05-12  2004
3       SUDESTE     RIO DE JANEIRO                 2.045 2004-05-12  2004
4  CENTRO OESTE        MATO GROSSO                 2.358 2004-05-12  2004

In [10]:
df.to_csv('data_clean.csv')